import { Service } from "@/types/service";
import { shantellSans } from "@/lib/fonts";

export const servicesData: Service[] = [
  {
    id: 1,
    title: "Консультація SMM онлайн",
    detail: '',
    price: "2000 грн • 1-1,5 год",
    icon: "/images/IMG_1823.PNG",
  },
  {
    id: 2,
    title: "Експрес розбір профілю онлайн",
    detail:
      "• аналіз шапки, візуалу, контенту, позиціонування\n• відповіді на Ваші запитання в реальному часі",
    price: "1500 грн",
    icon: "/images/IMG_1824.PNG",
  },
  {
    id: 3,
    title:
      "Повна консультація + PDF з планом дій онлайн/офлайн Київ або Черкаси",
    detail:
      "• детальний розбір Вашої сторінки на дзвінку, зустрічі\n• письмовий документ з рекомендаціями та покроковим планом після особистого спілкування, видача протягом 7 днів",
    price: "3000 грн",
    icon: "/images/IMG_1825.PNG",
  },
  {
    id: 4,
    title: "Зйомки для особистого бренду та бізнесу",
    detail: (
      <>
        <div
          className={`${shantellSans.className} font-semibold text-blue-600 mt-[3vh]`}
          style={{ fontSize: "1.08rem", color: "var(--color-accent)" }}
        >
          {" "}
          🙋🏻‍♀️ «Інста-подруга» — 1500 грн/год
        </div>
        <ul className="list-none mt-[0.6vh] flex flex-col justify-end pl-[4vw]">
          <li>• просто гарно відзнятий матеріал (без монтажу)</li>
          <li>• фото, відео, тіктоки — усе відразу після зйомки</li>
          <li>💡 формат «інста-прогулянки», кави чи швидкої контент-сесії</li>
        </ul>

        <div
          className={`${shantellSans.className} font-semibold text-blue-600 mt-[3vh] `}
          style={{ fontSize: "1.08rem", color: "var(--color-accent)" }}
        >
          {" "}
          🤳🏽 «На Easy» — 2500 грн/год
        </div>
        <ul className="list-none mt-[0.6vh] flex flex-col justify-end pl-[4vw]">
          <li>• зйомка + легкий монтаж відео чи тіктоків</li>
          <li>• експрес-обробка до 10 фото (за запитом)</li>
          <li>
            💡 кількість готових відео залежить від знятого матеріалу (зазвичай
            2-3 за год)
          </li>
        </ul>

        <div
          className={`${shantellSans.className} font-semibold text-blue-600 mt-[3vh] `}
          style={{ fontSize: "1.08rem", color: "var(--color-accent)" }}
        >
          {" "}
          👩🏻‍💻 «Top для топів» — 3000 грн/год
        </div>
        <ul className="list-none mt-[0.6vh] flex flex-col justify-end pl-[4vw]">
          <li>• зйомка, монтаж з переходами, субтитрами, текстом, логотипом</li>
          <li>• експрес-обробка до 15 фото (за запитом)</li>
          <li>‼️ графічні анімації не створюю</li>
        </ul>
      </>
    ),
    price: "",
    icon: "/images/IMG_1826.PNG",
  },

  {
    id: 5,
    title: "Ведення проєкту під ключ",
    detail: "Комплексний супровід Вашого бренду в соціальних мережах",
    price: "Наразі всі місця зайняті",
    icon: "/images/IMG_1827.PNG",
  },
  {
    id: 6,
    title: "Спікер на Ваш захід",
    detail: "Виступи, майстер-класи, лекції з SMM та контент-маркетингу",
    price: "Умови обговорюються особисто",
    icon: "/images/IMG_1828.PNG",
  },
  {
    id: 7,
    title: "Корпоративні воркшопи",
    detail: "Практичні навчання для команд, тривалість 2-2,5 години",
    price: "Умови обговорюються особисто",
    icon: "/images/IMG_1831.PNG",
  },
];
